In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv('spam_ham_dataset.csv')

In [3]:
dataset.head()

,Unnamed: 0,label,text,label_num
0,605,ham,Subject: enron methanol ; meter # : 988291\r\n...,0
1,2349,ham,"Subject: hpl nom for january 9 , 2001\r\n( see...",0
2,3624,ham,"Subject: neon retreat\r\nho ho ho , we ' re ar...",0
3,4685,spam,"Subject: photoshop , windows , office . cheap ...",1
4,2030,ham,Subject: re : indian springs\r\nthis deal is t...,0

In [4]:
dataset.keys()

Index(['Unnamed: 0', 'label', 'text', 'label_num'], dtype='object')

In [5]:
dataset.shape

(5171, 4)

In [13]:
x = dataset.drop('label_num', axis = 1)
y = dataset['label_num']

In [14]:
x.head()

   Unnamed: 0 label                                               text
0         605   ham  Subject: enron methanol ; meter # : 988291\r\n...
1        2349   ham  Subject: hpl nom for january 9 , 2001\r\n( see...
2        3624   ham  Subject: neon retreat\r\nho ho ho , we ' re ar...
3        4685  spam  Subject: photoshop , windows , office . cheap ...
4        2030   ham  Subject: re : indian springs\r\nthis deal is t...

In [15]:
y.head()

0    0
1    0
2    0
3    1
4    0
Name: label_num, dtype: int64